# Outlier Detection

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as stats

In [4]:
# Sample Data
data = pd.DataFrame({
    'value': [10, 12, 12, 13, 12, 11, 10, 100]
})

In [5]:
data

   value
0     10
1     12
2     12
3     13
4     12
5     11
6     10
7    100

In [6]:
z_scores = np.abs(stats.zscore(data['value']))

In [24]:
threshold = 2
outliers = np.where(z_scores > threshold)[0]

In [25]:
data

   value
0     10
1     12
2     12
3     13
4     12
5     11
6     10
7    100

In [26]:
# Outlier  --- IGNORE ---
print("Outliers detected at indices:", outliers)

Outliers detected at indices: [7]

In [30]:
data['Z_score'] = z_scores

In [31]:
data

   value   Z_score
0     10  0.426494
1     12  0.358255
2     12  0.358255
3     13  0.324136
4     12  0.358255
5     11  0.392375
6     10  0.426494
7    100  2.644266

In [41]:
df  = data[data['Z_score'] < 2.5]

In [42]:
df.drop(columns=['Z_score'], inplace=True)

C:\Users\moham\AppData\Local\Temp\ipykernel_3100\2658219290.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.drop(columns=['Z_score'], inplace=True)

In [43]:
df.head()

   value
0     10
1     12
2     12
3     13
4     12

In [44]:
df1 = sns.load_dataset("titanic")

In [45]:
df1.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]